#include <iostream>

int main() {
  std::string name;
  int debt;
  int money;
  std::cout <<"Введите ваше имя: ";
  std::cin >> name;
  std::cout << "Введите сумму долга: ";
  std::cin >> debt;

  while(debt > 0){
    std::cout << name << ", ваша задолженность составляет " << debt << " рублей.\nСколько рублей вы внесете прямо сейчас, чтобы ее погасить? : ";
    std::cin >> money;
    debt -= money;
  }
  std::cout <<"Спасибо, что погасили задолженность!\nОстаток на счету = " << debt*-1;
}

/*
Задача 4. Коллекторы 2.0.

Улучшите робота-коллектора. Теперь сумма долга должна уменьшаться, если пользователь ввел сумму, меньшую чем сумму долга. Также обеспечьте контроль ввода. Если пользователь внес большую сумму, чем требуется для погашения, выведите сообщение о том, какой у него остаток на счету после такой операции.
*/